otext1 = """파이썬이란?

파이썬은 1991년, 네덜란드계 프로그래머인 "귀도 반로섬"이 발표한 고급 프로그래밍 언어이다.

특징:
  - 플랫폼 독립적
  - 인터프리터식
  - 객체지향적
  - 동적 타이핑
  - 대화형 언어
  - 구조적 프로그래밍도 지원함
  - 버전별로 다른 문법을 지원할 수도 있어 버전별로 코드를 다르게 작성해야 할 수도 있음

역사:
  - Python 1: 1994년 1월에 처음 시작, 2000년 9월에 1.6 버전 발표
  - Python 2: 2000년 10월 16일에 2.0 버전 발표, 2020년 4월에 2.7.18 출시, 2020년 1월 1일에 지원 종료
  - Python 3.x: 2008년 12월 3일에 3.0 버전 발표, 파이썬 3.9 버전 이상부터는 32비트 컴퓨터에서 사용할 수 없음, 최신 버전은 3.10.7

비영리의 파이썬 소프트웨어 재단이 관리하는 개방형, 공동체 기반 개발 모델을 가지고 있다.
"""
otext2 = """Python의 다양한 구현체:
  - Cython: C로 작성된 인터프리터
  - Stackless Python: C 스택을 사용하지 않는 인터프리터
  - Jython (JPython): JVM 용 인터프리터
  - IronPython: .NET 플랫폼용 인터프리터
  - PyPy: 파이썬으로 작성된 인터프리터

파일 확장자:
  - .py: 파이썬 텍스트 소스 파일
  - .pyc: 컴파일된 파이썬 바이너리 파일
  - .pyd: 파이썬 코드를 윈도우 DLL 파일로 변환한 파일
  - .pyo: 최적화된 파이썬 바이너리 파일
"""
otext3="""파이썬은 들여 쓰기를 기준으로 블록을 구분한다. 
  - 표준은 공백 4개이지만 동일한 공백 개수를 사용한다면 몇 개를 사용하든 상관 없음.
  
  🐶예시
  def method():
      print(1,2,3,4)
      print("hello")

      
파이썬은 표준 라이브러리(Standard Libraries)와 서드 파티 라이브러리(3rd-Party Libraries)를 가지고 있다.
"""